app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "Stanley Kubrick"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Stanley Kubrick'
---
  def find_with_same_director
    @movie = Movie.find params[:id]
    if @movie.director.nil? || @movie.director.empty?